import Accordion from "../../UI/Accordion";
import Header from "../../UI/Header";
import LinksSection from "../../UI/LinksSection";

const SLIDES = [
  {
    id: 1,
    image:
      "https://raw.githubusercontent.com/mahdi-q/Tarkhineh-App-API/refs/heads/master/images/header/FAQ.jpg",
    text: "سوالات متداول از ترخینه",
  },
];

const LINKS = [
  {
    label: "سوالات متداول",
    href: "/FAQ",
  },
  {
    label: "قوانین ترخینه",
    href: "/rules",
  },
  {
    label: "حریم خصوصی",
    href: "/privacy",
  },
];

const ITEMS = [
  {
    mobile_title: "امکانات ترخینه",
    desktop_title: "ترخینه چه امکانات متفاوتی داره؟",
    description:
      "وبسایت سفارش غذای رستوران‌های زنجیره‌ای ترخینه با اتصال مستقیم به نرم افزار اتوماسیون شعبات رستوران، امکان اشتباهات هنگام ثبت سفارش آنلاین غذا و همچنین زمان مورد نیاز برای آماده سازی و تحویل آن را به حداقل ممکن می رسونه.",
  },
  {
    mobile_title: "حساب کاربری در ترخینه",
    desktop_title: "چطور می تونم در ترخینه حساب کاربری ایجاد کنم؟",
    description:
      "خیلی ساده، پس از انتخاب غذای مورد علاقه تان از منوی رستوران، هنگام ثبت سفارش با وارد کردن شماره تلفن همراه یک پیامک حاوی کد تایید برای شما ارسال و با وارد کردن کد تایید، ثبت نام شما تکمیل می شه. یا می تونید در صفحه اصلی سایت روی گزینه ورود کلیک کنید.",
  },
  {
    mobile_title: "سابقه خرید",
    desktop_title: "سابقه و لیست خریدهای قبلی ام رو کجا ببینم؟",
    description:
      "با ورود به حساب کاربری و کلیک روی گزینه سفارشات قبلی سابقه تمام خریدهای شما نمایش داده می شه.",
  },
  {
    mobile_title: "راه‌های پرداخت",
    desktop_title: "چه راه هایی برای پرداخت دارم؟",
    description:
      "هنگام ثبت سفارش غذا می تونید روش پرداخت دلخواه خودتون رو انتخاب کنید. آنلاین و یا نقدی در هنگام تحویل سفارش بصورت حضوری.",
  },
  {
    mobile_title: "تفاوت قیمت در منو شعبات و منو وبسایت",
    desktop_title:
      "آیا قیمت در منوی وبسایت ترخینه با قیمت منوی شعبات رستوران یکسان است؟",
    description:
      "بله. قیمت منوی وبسایت ترخینه دقیقا مطابق با قیمت منوی شعب رستوران  است و در صورت تغییر قیمت از طرف رستوران این تغییر در وبسایت ترخینه بلافاصله قابل مشاهده است.",
  },
  {
    mobile_title: "هدیه و تخفیف",
    desktop_title: "چطور می تونم از اعتبار هدیه و تخفیف استفاده کنم؟",
    description:
      "برای استفاده از کد تخفیف میتونید به سادگی کد رو در سبد خرید، در قسمت مشخص شده وارد کنید. اعتبار هدیه هنگام انتخاب روش پرداخت برای شما نمایش داده میشه و در صورت تمایل میتونید ازش استفاده کنید.",
  },
];

function FAQLayout() {
  return (
    <div className="minimum-height">
      <Header slides={SLIDES} />

      <LinksSection links={LINKS} />

      <div className="container">
        <Accordion items={ITEMS} />
      </div>
    </div>
  );
}
export default FAQLayout;
